## Задача №1:
#
# Джон Макклейн пытается найти этаж на котором заложена бомба и у него есть список инструкций (в файле data/1.txt):
#
# (- Джон должен подняться на этаж выше
# ) - Джон должен опуститься на этаж ниже
#
# Поиск начинается с нулевого этажа. 
#
# На каком этаже находится бомба?
#
## Требования к решению:
# - Входные данные находятся в файле data/1.txt
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:
file = File.new("data/1.txt","r:UTF-8")
lines = file.read
k = 0
lines.each_char do |char|
    if char == "("
        k+=1
      end
      if char == ")"
        k-=1
      end
end
puts(k)
file.close



